# Kruskal with reversed Groups... 1 = State comparison / 7 = Quis dabit capiti

> kruskalmc(Z ~ Group, data = signAll, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     4.3     34.26472      FALSE
1-3    23.1     34.26472      FALSE
1-4    22.5     34.26472      FALSE
1-5    45.3     34.26472       TRUE
1-6    32.8     34.26472      FALSE
1-7    48.4     34.26472       TRUE
> kruskalmc(Z ~ Group, data = signLog, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     3.4     34.26472      FALSE
1-3    16.3     34.26472      FALSE
1-4    25.3     34.26472      FALSE
1-5    44.3     34.26472       TRUE
1-6    36.7     34.26472       TRUE
1-7    49.0     34.26472       TRUE
> kruskalmc(Z ~ Group, data = signLogGap, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     1.9     34.26472      FALSE
1-3     9.6     34.26472      FALSE
1-4    25.1     34.26472      FALSE
1-5    34.8     34.26472       TRUE
1-6    50.2     34.26472       TRUE
1-7    45.0     34.26472       TRUE
> kruskalmc(Z ~ Group, data = signVisGap, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     4.1     34.26472      FALSE
1-3    15.3     34.26472      FALSE
1-4    25.1     34.26472      FALSE
1-5    39.1     34.26472       TRUE
1-6    44.5     34.26472       TRUE
1-7    50.4     34.26472       TRUE
> kruskalmc(Z ~ Group, data = super, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     1.9     34.26472      FALSE
1-3     4.3     34.26472      FALSE
1-4    25.5     34.26472      FALSE
1-5    36.3     34.26472       TRUE
1-6    39.7     34.26472       TRUE
1-7    44.9     34.26472       TRUE
> kruskalmc(Z ~ Group, data = superGap, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     1.3     34.26472      FALSE
1-3     5.3     34.26472      FALSE
1-4    23.6     34.26472      FALSE
1-5    34.4     34.26472       TRUE
1-6    47.6     34.26472       TRUE
1-7    43.2     34.26472       TRUE
> kruskalmc(Z ~ Group, data = withoutAll, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     3.1     34.26472      FALSE
1-3    12.1     34.26472      FALSE
1-4    27.1     34.26472      FALSE
1-5    42.1     34.26472       TRUE
1-6    32.7     34.26472      FALSE
1-7    48.8     34.26472       TRUE
> kruskalmc(Z ~ Group, data = withoutLog, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     1.5     34.26472      FALSE
1-3     7.7     34.26472      FALSE
1-4    26.7     34.26472      FALSE
1-5    41.9     34.26472       TRUE
1-6    36.9     34.26472       TRUE
1-7    45.6     34.26472       TRUE
> kruskalmc(Z ~ Group, data = withoutLogGap, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     2.3     34.26472      FALSE
1-3     8.1     34.26472      FALSE
1-4    24.6     34.26472      FALSE
1-5    34.3     34.26472       TRUE
1-6    48.6     34.26472       TRUE
1-7    45.9     34.26472       TRUE
> kruskalmc(Z ~ Group, data = withoutVisGap, probs = 0.001, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.001 
Comparisons
    obs.dif critical.dif difference
1-2     3.0     34.26472      FALSE
1-3    11.4     34.26472      FALSE
1-4    24.0     34.26472      FALSE
1-5    38.0     34.26472       TRUE
1-6    42.3     34.26472       TRUE
1-7    49.3     34.26472       TRUE



> # Again with lower prob level
> kruskalmc(Z ~ Group, data = signAll, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     4.3     28.61425      FALSE
1-3    23.1     28.61425      FALSE
1-4    22.5     28.61425      FALSE
1-5    45.3     28.61425       TRUE
1-6    32.8     28.61425       TRUE
1-7    48.4     28.61425       TRUE
> kruskalmc(Z ~ Group, data = signLog, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     3.4     28.61425      FALSE
1-3    16.3     28.61425      FALSE
1-4    25.3     28.61425      FALSE
1-5    44.3     28.61425       TRUE
1-6    36.7     28.61425       TRUE
1-7    49.0     28.61425       TRUE
> kruskalmc(Z ~ Group, data = signLogGap, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     1.9     28.61425      FALSE
1-3     9.6     28.61425      FALSE
1-4    25.1     28.61425      FALSE
1-5    34.8     28.61425       TRUE
1-6    50.2     28.61425       TRUE
1-7    45.0     28.61425       TRUE
> kruskalmc(Z ~ Group, data = signVisGap, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     4.1     28.61425      FALSE
1-3    15.3     28.61425      FALSE
1-4    25.1     28.61425      FALSE
1-5    39.1     28.61425       TRUE
1-6    44.5     28.61425       TRUE
1-7    50.4     28.61425       TRUE
> kruskalmc(Z ~ Group, data = super, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     1.9     28.61425      FALSE
1-3     4.3     28.61425      FALSE
1-4    25.5     28.61425      FALSE
1-5    36.3     28.61425       TRUE
1-6    39.7     28.61425       TRUE
1-7    44.9     28.61425       TRUE
> kruskalmc(Z ~ Group, data = superGap, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     1.3     28.61425      FALSE
1-3     5.3     28.61425      FALSE
1-4    23.6     28.61425      FALSE
1-5    34.4     28.61425       TRUE
1-6    47.6     28.61425       TRUE
1-7    43.2     28.61425       TRUE
> kruskalmc(Z ~ Group, data = withoutAll, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     3.1     28.61425      FALSE
1-3    12.1     28.61425      FALSE
1-4    27.1     28.61425      FALSE
1-5    42.1     28.61425       TRUE
1-6    32.7     28.61425       TRUE
1-7    48.8     28.61425       TRUE
> kruskalmc(Z ~ Group, data = withoutLog, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     1.5     28.61425      FALSE
1-3     7.7     28.61425      FALSE
1-4    26.7     28.61425      FALSE
1-5    41.9     28.61425       TRUE
1-6    36.9     28.61425       TRUE
1-7    45.6     28.61425       TRUE
> kruskalmc(Z ~ Group, data = withoutLogGap, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     2.3     28.61425      FALSE
1-3     8.1     28.61425      FALSE
1-4    24.6     28.61425      FALSE
1-5    34.3     28.61425       TRUE
1-6    48.6     28.61425       TRUE
1-7    45.9     28.61425       TRUE
> kruskalmc(Z ~ Group, data = withoutVisGap, probs = 0.01, cont = 'two-tailed')
Multiple comparison test after Kruskal-Wallis, treatments vs control (two-tailed) 
p.value: 0.01 
Comparisons
    obs.dif critical.dif difference
1-2     3.0     28.61425      FALSE
1-3    11.4     28.61425      FALSE
1-4    24.0     28.61425      FALSE
1-5    38.0     28.61425       TRUE
1-6    42.3     28.61425       TRUE
1-7    49.3     28.61425       TRUE